ELEMENT_NAMES = {
    0: 'Старт',
    10: 'Следующий круг',
    11: 'Финиш',

    1: 'Прямая',
    2: 'Длинная прямая',
    3: 'Поворот',
    4: 'Резкий поворот',
    5: 'Затяжной поворот',
    6: 'Шикана'
}

ELEMENT_EMOJI = {
    0: '🏁',
    10: '🏁',
    11: '🏁',

    1: '⬆️',
    2: '⏫',
    3: '➡️',
    4: '↪️',
    5: '↗️',
    6: '↔️'
}

ALLOWED_MONTHS = ['April', 'March', 'May', 'June', 'July', 'August', 'September', 'November']
ALLOWED_HOURS = [i for i in range(9, 21)]
ALLOWED_MINUTES = [i for i in range(0, 60, 5)]
